// Напишите программу, которая выводит массив из N элементов, 
// заполненный нулями и единицами в случайном порядке.
// Самое левое число != 0
// Данный массив есть двоичное представление десятичного числа
// [1,0,1,1,0,1,0,0]
// Реализовать перевод двоичного числа в десятичное

// 1. Ввод N 
// 2. Создание массива 
// 3. Заполнение массива 0 и 1 
// 4. Печать массива 
// 5. Конвертация из 2-ого в 10-ое 
// 6. 10110100 >> 180 

// 1. Ввод N
int GetNumberByUser(string text)

// 2. Создание массива
int[] CreateArray(int size)

// 3. Заполнение массива 0 и 1

// 4. Печать массива

// 5. Конвертация из 2-ого в 10-ое

// 6. 10110100 >> 180